trade_exp/src/Documents/ГрафикВыходаВодителей/ГрафикВыходаВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d4584df-31c9-42b8-bfbd-2c116acdb5e2">
  <name>ГрафикВыходаВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="64fbaa50-1e61-49f0-b088-1daf39e07d84">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37a1d8ed-cde0-4f9e-ae42-cc0af8c2d9ed">
    <name>ПланФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e851a61-b832-4cee-b13e-5781496ef14d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e83ef77-f800-410c-8261-65bf25dc3db5">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65a55a79-e302-4248-9095-8bcdfac1c18c">
    <name>ПериодРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="c3c20324-641f-4963-a246-2ad974f75c01">
    <name>График</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6558910b-6305-4a65-8122-06b536ff176b">
      <name>Представление17</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="128aecc0-0541-4ebc-b1b1-ac4e3a71420a">
      <name>Представление14</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="05835100-e434-44e1-8c47-b1ea87290a61">
      <name>Представление18</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e58edd9f-2902-4f6c-b937-21cac4fd7788">
      <name>Представление8</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bac0343f-97e6-493c-88f2-f5bfe262ae01">
      <name>Представление20</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e2a22b3d-5867-4555-acd0-7e9301cba0ce">
      <name>Представление10</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1bb321a4-709a-4cc3-b73d-a2fd107b16c8">
      <name>Представление27</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b4ac0ab8-8a7e-4a85-8e7a-56862b7753bb">
      <name>Водитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4e254b46-11cf-4efa-bcab-24dd92a78d08">
      <name>Представление12</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e38f9446-d03b-47dc-8b7c-bef27deb6f7d">
      <name>Автомобиль</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a8d711dc-ec11-44e8-b772-33486173a421">
      <name>Представление7</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="24d9719c-7e75-4d84-a118-dc0a3920a930">
      <name>Представление1</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7b9dbb39-83b0-4ed1-b60a-69abe96dab71">
      <name>Представление2</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c59f8043-f0fa-4a56-bfd3-a59772a94d0e">
      <name>Представление28</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aefea4c3-bd1d-4725-b4d9-da957e3f2626">
      <name>Представление3</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="66a55d56-006d-44a2-a48e-3bee8aa460f8">
      <name>Представление4</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5c5f8a61-05ec-4ab8-a9c5-04134e61d0e1">
      <name>Представление5</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="18983cf0-889a-41d4-a344-2a8e2e044acf">
      <name>Представление6</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b19eabeb-18c7-4aa0-a66c-dcfbf6a46d31">
      <name>Представление11</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4021812b-868f-47dc-844f-b83097fde19f">
      <name>Представление9</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a80889db-52cb-4a0e-ab70-4cf8c82229a4">
      <name>Представление31</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8fa4781b-db2d-4132-83a0-26dd9d4b50b4">
      <name>Представление13</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="642cf82a-f36c-4274-8c2e-3c822f98ea9e">
      <name>Представление15</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b78f1962-a38a-4273-86a1-baafa0fd9874">
      <name>Представление16</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="103ec266-56ae-4cfd-a809-0d88f3953adb">
      <name>КоличествоВыходов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8d76a6a6-3c5b-432f-9e7c-bd1348e4d552">
      <name>Представление26</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d1947ae6-57fa-4a27-8083-65d161796424">
      <name>Представление19</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7878d53c-dd7d-4314-ab6a-0f74becb46c9">
      <name>Представление21</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6b39b437-5d6e-4801-83c0-6c381af113d4">
      <name>Представление22</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4de1fb48-8950-4009-913b-8ff442f6044a">
      <name>Представление23</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2e6224a7-4654-4056-8970-717dbb5aa920">
      <name>Представление24</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8f3837f4-3f97-440f-b3fa-1d61ebcbe603">
      <name>Представление25</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0bb48c47-b607-48d2-9fc4-8f33f244b9fc">
      <name>Представление29</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e260b36e-d3d7-44ba-a2a4-b059b49c89b8">
      <name>Представление30</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ГрафикВыходаВодителей/Forms/ФормаДокумента/Module.bsl
////////////////////// События формы /////////////////////////////
 #Область СобытияФормы  
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Объект.ПериодРегистрации= НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	МесяцРегистрацииСтрокой= УчетРабочегоВремениСервер.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	КолДнейВМес= День(КонецМесяца(Объект.ПериодРегистрации));
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ОбновитьИтоги();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для сч = 1 По КолДнейВМес Цикл
		Элемент = Элементы["ГрафикПредставление"+сч];
		Элемент.Заголовок = Строка(сч);

		ТекДата = Дата(Год(Объект.ПериодРегистрации),Месяц(Объект.ПериодРегистрации), сч);
		ВидДня = УчетРабочегоВремениСервер.ПолучитьВидДня(ТекДата);
		Если ВидДня = Неопределено Тогда
			Элемент.ЦветФонаЗаголовка = Новый Цвет(100, 100, 100);
			Элемент.ЦветТекста= Новый Цвет(100, 100, 100);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(0, 0, 0);
			Элемент.ЦветТекста = Новый Цвет(0, 0, 0);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(0, 0, 255);
			Элемент.ЦветТекста= Новый Цвет(0, 0, 255);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
			Элемент.ЦветТекста= Новый Цвет(255, 0, 0);
		ИначеЕсли ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник") Тогда
			Элемент.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 255);
			Элемент.ЦветТекста= Новый Цвет(255, 0, 255);
		КонецЕсли;
		
	КонецЦикла;
	//Скроем не нужные
	Для сч = КолДнейВМес + 1 По 31 Цикл
		Элемент = ЭтаФорма.Элементы["ГрафикПредставление" + сч];	
		Элемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("РедактируемыйОбъект", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПутьРеквизита", "Объект.ПериодРегистрации");
	ДополнительныеПараметры.Вставить("ПутьРеквизитаПредставления", "МесяцРегистрацииСтрокой");
	ДополнительныеПараметры.Вставить("ИзменитьМодифицированность", Истина);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтаФорма, "Объект.ПериодРегистрации");
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
	Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Значение, "Месяц", Ложь),
	ЭтаФорма, , , ,ОповещениеЗавершения , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	Объект.ПериодРегистрации = ЗначениеВыбрано;
	МесяцРегистрацииСтрокой = УчетРабочегоВремениКлиент.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	КолДнейВМес = День(КонецМесяца(Объект.ПериодРегистрации));  
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцРегистрацииСтрокой = УчетРабочегоВремениКлиент.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	КолДнейВМес = День(КонецМесяца(Объект.ПериодРегистрации));  
	
КонецПроцедуры  

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Движения(Команда)
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", Новый Структура("Документ", Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВодителями(Команда)
	ЗаполнитьВодителямиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВодителямиНаСервере()
	
	Объект.График.Очистить();
	Документы.ГрафикВыходаВодителей.ЗаполнитьВодителями(Объект);
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоФакту(Команда)
	ЗаполнитьПоФактуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоФактуНаСервере()  
	
	Документы.ГрафикВыходаВодителей.ЗаполнитьПоФакту(Объект);
	ОбновитьИтоги(); 
	
КонецПроцедуры

#КонецОбласти

////////////////////// Обработка Графика /////////////////////////////
 #Область ОбработкаГрафика

&НаКлиенте
Процедура ГрафикПриИзменении(Элемент)
	ОбновитьИтоги();
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуПодвала(стр) 
	
	 Отбор = Новый Структура("Автомобиль", стр);
	 СтрокиПодвала = Объект.График.НайтиСтроки(Отбор);
	 Если СтрокиПодвала.Количество() = 0 Тогда
		 НоваяСтрока = Объект.График.Добавить();
		 НоваяСтрока.Автомобиль = стр;
		 НоваяСтрока.ИтоговаяСтрока = Истина;
	 Иначе
		 НоваяСтрока = СтрокиПодвала[0];
	 КонецЕсли;
	 
	 Возврат НоваяСтрока; 
		 
КонецФункции 
 
#КонецОбласти

////////////////////// Функции расчета /////////////////////////////
 #Область Расчеты
 
 &НаСервере
 Процедура ОбновитьИтоги()
	 
	 //Подвал
	 СтрокаПодвала15т = ПолучитьСтрокуПодвала("1,5 т");
	 СтрокаПодвала3т = ПолучитьСтрокуПодвала("3 т");
	 СтрокаПодвалаСамогрузы = ПолучитьСтрокуПодвала("Самогрузы");
	 СтрокаПодвала6м = ПолучитьСтрокуПодвала("6 м");
	 СтрокаПодвалаИтого15т = ПолучитьСтрокуПодвала("Итого 1,5 (3т=2авто 1,5т)");
	 СтрокаПодвалаВсегоБезСамогрузов = ПолучитьСтрокуПодвала("Всего авто без самогрузов");
	 
	 Для Каждого График Из Объект.График Цикл
		 Если Не ЗначениеЗаполнено(График.Водитель) Тогда 
			 Продолжить;
		 КонецЕсли;
			 
		 Если Не ЗначениеЗаполнено(График.Автомобиль) Тогда
		 График.Автомобиль = Документы.ГрафикВыходаВодителей.ПолучитьАвтомобиль(График.Водитель);
	 КонецЕсли;
	 
		 Если Не ЗначениеЗаполнено(График.Автомобиль) Тогда 
			 Продолжить;
		 КонецЕсли;
	 
		 //Заполним параметры
		График.ГрузоподъемностьВТоннах = График.Автомобиль.ГрузоподъемностьВТоннах;
		График.МаксимальнаяДлинаГруза = График.Автомобиль.МаксимальнаяДлинаГруза;
		  
		КоличествоВыходов = 0;
		Для сч = 1 По КолДнейВМес Цикл
			 стрЗначение = СокрЛП(График["Представление" + сч]);
			 
			 Если стрЗначение = "1" Или НРег(стрЗначение) = "в1" Тогда
				 КоличествоВыходов = КоличествоВыходов + 1;
			 КонецЕсли;
		 КонецЦикла;
		 График.КоличествоВыходов = КоличествоВыходов;
	 КонецЦикла;
	 
	 //Итоги вертикально
	 Для сч = 1 По КолДнейВМес Цикл
		 ИтогПодвала15т = 0;
		 ИтогПодвала3т = 0;
		 ИтогПодвалаСамогрузы = 0;
		 ИтогПодвала6м = 0;
		 ИтогПодвалаИтого15т = 0;
		 ИтогПодвалаВсегоБезСамогрузов = 0;
		 
		 Для Каждого График Из Объект.График Цикл
			 Если ТипЗнч(График.Автомобиль) = Тип("Строка") Тогда
				 Продолжить;
			 КонецЕсли;
			 стрЗначение = СокрЛП(График["Представление" + сч]);	 
			 
			 Если стрЗначение = "1" Или НРег(стрЗначение) = "в1" Тогда
				 //Вставляем итоги
				 Если График.Автомобиль.ГрузоподъемностьВТоннах < 3 Тогда
					 ИтогПодвала15т = ИтогПодвала15т+1;
				 Иначе
					 Если График.Автомобиль.Самогруз Тогда
						 ИтогПодвалаСамогрузы = ИтогПодвалаСамогрузы + 1;
					 Иначе
					 	ИтогПодвала3т = ИтогПодвала3т+1;
					 КонецЕсли;
				 КонецЕсли;
				 Если График.Автомобиль.МаксимальнаяДлинаГруза >= 6 Тогда
					 ИтогПодвала6м = ИтогПодвала6м + 1;
				 КонецЕсли;
				 ИтогПодвалаИтого15т = ИтогПодвала15т + ИтогПодвала3т*2;
				 ИтогПодвалаВсегоБезСамогрузов = ИтогПодвала15т + ИтогПодвала3т;
			 КонецЕсли;
		 КонецЦикла;
		 СтрокаПодвала15т["Представление" + сч] = Строка(ИтогПодвала15т);
		 СтрокаПодвала3т["Представление" + сч] = Строка(ИтогПодвала3т);
		 СтрокаПодвалаСамогрузы["Представление" + сч] = Строка(ИтогПодвалаСамогрузы);
		 СтрокаПодвала6м["Представление" + сч] = Строка(ИтогПодвала6м);
		 СтрокаПодвалаИтого15т["Представление" + сч] = Строка(ИтогПодвалаИтого15т);
		 СтрокаПодвалаВсегоБезСамогрузов["Представление" + сч] = Строка(ИтогПодвалаВсегоБезСамогрузов);
	 КонецЦикла;
	 
	 Объект.График.Сортировать("ИтоговаяСтрока Возр"); 
	 ЭтаФорма.Модифицированность = Истина;  
	 
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды Не работает
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
